title: Suspicious Rundll32 Execution

id: 5f5d5b42-7b0e-4f6f-9f8a-111111111111

status: experimental

description: Detects suspicious execution of rundll32.exe.

author: Huzaifa

date: 2026-07-16

logsource:
  product: windows
  category: process_creation

detection:
  selection:
    Image|endswith: '\rundll32.exe'
  condition: selection

falsepositives:
  - Legitimate Windows administration

level: medium

tags:
  - attack.execution
  - attack.t1218.011